wtliu/EtherCAT_LAN9252_TMS320F28379D/library/driverlib/include/pin_map.h
#define GPIO_18_GPIO18         0x00080400U
#define GPIO_18_SPICLKA        0x00080401U
#define GPIO_18_SCITXDB        0x00080402U
#define GPIO_18_CANRXA         0x00080403U
#define GPIO_18_EPWM10A        0x00080405U
#define GPIO_18_SD_D2          0x00080407U
#define GPIO_18_UPP_D2         0x0008040FU

#define GPIO_19_GPIO19         0x00080600U
#define GPIO_19_SPISTEA        0x00080601U
#define GPIO_19_SCIRXDB        0x00080602U
#define GPIO_19_CANTXA         0x00080603U
#define GPIO_19_EPWM10B        0x00080605U
#define GPIO_19_SD_C2          0x00080607U
#define GPIO_19_UPP_D1         0x0008060FU

#define GPIO_20_GPIO20         0x00080800U
#define GPIO_20_EQEP1A         0x00080801U
#define GPIO_20_MDXA           0x00080802U
#define GPIO_20_CANTXB         0x00080803U
#define GPIO_20_EPWM11A        0x00080805U
#define GPIO_20_SD_D3          0x00080807U
#define GPIO_20_UPP_D0         0x0008080FU

#define GPIO_21_GPIO21         0x00080A00U
#define GPIO_21_EQEP1B         0x00080A01U
#define GPIO_21_MDRA           0x00080A02U
#define GPIO_21_CANRXB         0x00080A03U
#define GPIO_21_EPWM11B        0x00080A05U
#define GPIO_21_SD_C3          0x00080A07U
#define GPIO_21_UPP_CLK        0x00080A0FU

#define GPIO_22_GPIO22         0x00080C00U
#define GPIO_22_EQEP1S         0x00080C01U
#define GPIO_22_MCLKXA         0x00080C02U
#define GPIO_22_SCITXDB        0x00080C03U
#define GPIO_22_EPWM12A        0x00080C05U
#define GPIO_22_SPICLKB        0x00080C06U
#define GPIO_22_SD_D4          0x00080C07U

#define GPIO_23_GPIO23         0x00080E00U
#define GPIO_23_EQEP1I         0x00080E01U
#define GPIO_23_MFSXA          0x00080E02U
#define GPIO_23_SCIRXDB        0x00080E03U
#define GPIO_23_EPWM12B        0x00080E05U
#define GPIO_23_SPISTEB        0x00080E06U
#define GPIO_23_SD_C4          0x00080E07U

#define GPIO_24_GPIO24         0x00081000U
#define GPIO_24_OUTPUTXBAR1    0x00081001U
#define GPIO_24_EQEP2A         0x00081002U
#define GPIO_24_MDXB           0x00081003U
#define GPIO_24_SPISIMOB       0x00081006U
#define GPIO_24_SD_D5          0x00081007U

#define GPIO_25_GPIO25         0x00081200U
#define GPIO_25_OUTPUTXBAR2    0x00081201U
#define GPIO_25_EQEP2B         0x00081202U
#define GPIO_25_MDRB           0x00081203U
#define GPIO_25_SPISOMIB       0x00081206U
#define GPIO_25_SD_C5          0x00081207U

#define GPIO_26_GPIO26         0x00081400U
#define GPIO_26_OUTPUTXBAR3    0x00081401U
#define GPIO_26_EQEP2I         0x00081402U
#define GPIO_26_MCLKXB         0x00081403U
#define GPIO_26_SPICLKB        0x00081406U
#define GPIO_26_SD_D6          0x00081407U

#define GPIO_27_GPIO27         0x00081600U
#define GPIO_27_OUTPUTXBAR4    0x00081601U
#define GPIO_27_EQEP2S         0x00081602U
#define GPIO_27_MFSXB          0x00081603U
#define GPIO_27_SPISTEB        0x00081606U
#define GPIO_27_SD_C6          0x00081607U

#define GPIO_28_GPIO28         0x00081800U
#define GPIO_28_SCIRXDA        0x00081801U
#define GPIO_28_EM1CS4N        0x00081802U
#define GPIO_28_OUTPUTXBAR5    0x00081805U
#define GPIO_28_EQEP3A         0x00081806U
#define GPIO_28_SD_D7          0x00081807U

#define GPIO_29_GPIO29         0x00081A00U
#define GPIO_29_SCITXDA        0x00081A01U
#define GPIO_29_EM1SDCKE       0x00081A02U
#define GPIO_29_OUTPUTXBAR6    0x00081A05U
#define GPIO_29_EQEP3B         0x00081A06U
#define GPIO_29_SD_C7          0x00081A07U

#define GPIO_30_GPIO30         0x00081C00U
#define GPIO_30_CANRXA         0x00081C01U
#define GPIO_30_EM1CLK         0x00081C02U
#define GPIO_30_OUTPUTXBAR7    0x00081C05U
#define GPIO_30_EQEP3S         0x00081C06U
#define GPIO_30_SD_D8          0x00081C07U

#define GPIO_31_GPIO31         0x00081E00U
#define GPIO_31_CANTXA         0x00081E01U
#define GPIO_31_EM1WEN         0x00081E02U
#define GPIO_31_OUTPUTXBAR8    0x00081E05U
#define GPIO_31_EQEP3I         0x00081E06U
#define GPIO_31_SD_C8          0x00081E07U

#define GPIO_32_GPIO32         0x00460000U
#define GPIO_32_SDAA           0x00460001U
#define GPIO_32_EM1CS0N        0x00460002U

#define GPIO_33_GPIO33         0x00460200U
#define GPIO_33_SCLA           0x00460201U
#define GPIO_33_EM1RNW         0x00460202U

#define GPIO_34_GPIO34         0x00460400U
#define GPIO_34_OUTPUTXBAR1    0x00460401U
#define GPIO_34_EM1CS2N        0x00460402U
#define GPIO_34_SDAB           0x00460406U
#define GPIO_34_OFSD_2_N       0x0046040FU

#define GPIO_35_GPIO35         0x00460600U
#define GPIO_35_SCIRXDA        0x00460601U
#define GPIO_35_EM1CS3N        0x00460602U
#define GPIO_35_SCLB           0x00460606U
#define GPIO_35_IID            0x0046060FU

#define GPIO_36_GPIO36         0x00460800U
#define GPIO_36_SCITXDA        0x00460801U
#define GPIO_36_EM1WAIT1       0x00460802U
#define GPIO_36_CANRXA         0x00460806U
#define GPIO_36_ISESSEND       0x0046080FU

#define GPIO_37_GPIO37         0x00460A00U
#define GPIO_37_OUTPUTXBAR2    0x00460A01U
#define GPIO_37_EM1OEN         0x00460A02U
#define GPIO_37_CANTXA         0x00460A06U
#define GPIO_37_IAVALID        0x00460A0FU

#define GPIO_38_GPIO38         0x00460C00U
#define GPIO_38_EM1A0          0x00460C02U
#define GPIO_38_SCITXDC        0x00460C05U
#define GPIO_38_CANTXB         0x00460C06U

#define GPIO_39_GPIO39         0x00460E00U
#define GPIO_39_EM1A1          0x00460E02U
#define GPIO_39_SCIRXDC        0x00460E05U
#define GPIO_39_CANRXB         0x00460E06U

#define GPIO_40_GPIO40         0x00461000U
#define GPIO_40_EM1A2          0x00461002U
#define GPIO_40_SDAB           0x00461006U

#define GPIO_41_GPIO41         0x00461200U
#define GPIO_41_EM1A3          0x00461202U
#define GPIO_41_EMU1           0x00461203U
#define GPIO_41_SCLB           0x00461206U

#define GPIO_42_GPIO42         0x00461400U
#define GPIO_42_SDAA           0x00461406U
#define GPIO_42_SCITXDA        0x0046140FU

#define GPIO_43_GPIO43         0x00461600U
#define GPIO_43_SCLA           0x00461606U
#define GPIO_43_SCIRXDA        0x0046160FU

#define GPIO_44_GPIO44         0x00461800U
#define GPIO_44_EM1A4          0x00461802U
#define GPIO_44_IXRCV          0x0046180FU

#define GPIO_45_GPIO45         0x00461A00U
#define GPIO_45_EM1A5          0x00461A02U
#define GPIO_45_IDM            0x00461A0FU

#define GPIO_46_GPIO46         0x00461C00U
#define GPIO_46_EM1A6          0x00461C02U
#define GPIO_46_SCIRXDD        0x00461C06U
#define GPIO_46_IDP            0x00461C0FU

#define GPIO_47_GPIO47         0x00461E00U
#define GPIO_47_EM1A7          0x00461E02U
#define GPIO_47_SCITXDD        0x00461E06U
#define GPIO_47_OFSD_1_N       0x00461E0FU

#define GPIO_48_GPIO48         0x00480000U
#define GPIO_48_OUTPUTXBAR3    0x00480001U
#define GPIO_48_EM1A8          0x00480002U
#define GPIO_48_SCITXDA        0x00480006U
#define GPIO_48_SD1_D1         0x00480007U

#define GPIO_49_GPIO49         0x00480200U
#define GPIO_49_OUTPUTXBAR4    0x00480201U
#define GPIO_49_EM1A9          0x00480202U
#define GPIO_49_SCIRXDA        0x00480206U
#define GPIO_49_SD1_C1         0x00480207U

