wtliu/EtherCAT_LAN9252_TMS320F28379D/library/driverlib/include/pin_map.h
#define GPIO_50_GPIO50         0x00480400U
#define GPIO_50_EQEP1A         0x00480401U
#define GPIO_50_EM1A10         0x00480402U
#define GPIO_50_SPISIMOC       0x00480406U
#define GPIO_50_SD1_D2         0x00480407U

#define GPIO_51_GPIO51         0x00480600U
#define GPIO_51_EQEP1B         0x00480601U
#define GPIO_51_EM1A11         0x00480602U
#define GPIO_51_SPISOMIC       0x00480606U
#define GPIO_51_SD1_C2         0x00480607U

#define GPIO_52_GPIO52         0x00480800U
#define GPIO_52_EQEP1S         0x00480801U
#define GPIO_52_EM1A12         0x00480802U
#define GPIO_52_SPICLKC        0x00480806U
#define GPIO_52_SD1_D3         0x00480807U

#define GPIO_53_GPIO53         0x00480A00U
#define GPIO_53_EQEP1I         0x00480A01U
#define GPIO_53_EM1D31         0x00480A02U
#define GPIO_53_EM2D15         0x00480A03U
#define GPIO_53_SPISTEC        0x00480A06U
#define GPIO_53_SD1_C3         0x00480A07U

#define GPIO_54_GPIO54         0x00480C00U
#define GPIO_54_SPISIMOA       0x00480C01U
#define GPIO_54_EM1D30         0x00480C02U
#define GPIO_54_EM2D14         0x00480C03U
#define GPIO_54_EQEP2A         0x00480C05U
#define GPIO_54_SCITXDB        0x00480C06U
#define GPIO_54_SD1_D4         0x00480C07U

#define GPIO_55_GPIO55         0x00480E00U
#define GPIO_55_SPISOMIA       0x00480E01U
#define GPIO_55_EM1D29         0x00480E02U
#define GPIO_55_EM2D13         0x00480E03U
#define GPIO_55_EQEP2B         0x00480E05U
#define GPIO_55_SCIRXDB        0x00480E06U
#define GPIO_55_SD1_C4         0x00480E07U

#define GPIO_56_GPIO56         0x00481000U
#define GPIO_56_SPICLKA        0x00481001U
#define GPIO_56_EM1D28         0x00481002U
#define GPIO_56_EM2D12         0x00481003U
#define GPIO_56_EQEP2S         0x00481005U
#define GPIO_56_SCITXDC        0x00481006U
#define GPIO_56_SD2_D1         0x00481007U

#define GPIO_57_GPIO57         0x00481200U
#define GPIO_57_SPISTEA        0x00481201U
#define GPIO_57_EM1D27         0x00481202U
#define GPIO_57_EM2D11         0x00481203U
#define GPIO_57_EQEP2I         0x00481205U
#define GPIO_57_SCIRXDC        0x00481206U
#define GPIO_57_SD2_C1         0x00481207U

#define GPIO_58_GPIO58         0x00481400U
#define GPIO_58_MCLKRA         0x00481401U
#define GPIO_58_EM1D26         0x00481402U
#define GPIO_58_EM2D10         0x00481403U
#define GPIO_58_OUTPUTXBAR1    0x00481405U
#define GPIO_58_SPICLKB        0x00481406U
#define GPIO_58_SD2_D2         0x00481407U
#define GPIO_58_SPISIMOA       0x0048140FU

#define GPIO_59_GPIO59         0x00481600U
#define GPIO_59_MFSRA          0x00481601U
#define GPIO_59_EM1D25         0x00481602U
#define GPIO_59_EM2D9          0x00481603U
#define GPIO_59_OUTPUTXBAR2    0x00481605U
#define GPIO_59_SPISTEB        0x00481606U
#define GPIO_59_SD2_C2         0x00481607U
#define GPIO_59_SPISOMIA       0x0048160FU

#define GPIO_60_GPIO60         0x00481800U
#define GPIO_60_MCLKRB         0x00481801U
#define GPIO_60_EM1D24         0x00481802U
#define GPIO_60_EM2D8          0x00481803U
#define GPIO_60_OUTPUTXBAR3    0x00481805U
#define GPIO_60_SPISIMOB       0x00481806U
#define GPIO_60_SD2_D3         0x00481807U
#define GPIO_60_SPICLKA        0x0048180FU

#define GPIO_61_GPIO61         0x00481A00U
#define GPIO_61_MFSRB          0x00481A01U
#define GPIO_61_EM1D23         0x00481A02U
#define GPIO_61_EM2D7          0x00481A03U
#define GPIO_61_OUTPUTXBAR4    0x00481A05U
#define GPIO_61_SPISOMIB       0x00481A06U
#define GPIO_61_SD2_C3         0x00481A07U
#define GPIO_61_SPISTEA        0x00481A0FU

#define GPIO_62_GPIO62         0x00481C00U
#define GPIO_62_SCIRXDC        0x00481C01U
#define GPIO_62_EM1D22         0x00481C02U
#define GPIO_62_EM2D6          0x00481C03U
#define GPIO_62_EQEP3A         0x00481C05U
#define GPIO_62_CANRXA         0x00481C06U
#define GPIO_62_SD2_D4         0x00481C07U

#define GPIO_63_GPIO63         0x00481E00U
#define GPIO_63_SCITXDC        0x00481E01U
#define GPIO_63_EM1D21         0x00481E02U
#define GPIO_63_EM2D5          0x00481E03U
#define GPIO_63_EQEP3B         0x00481E05U
#define GPIO_63_CANTXA         0x00481E06U
#define GPIO_63_SD2_C4         0x00481E07U
#define GPIO_63_SPISIMOB       0x00481E0FU

#define GPIO_64_GPIO64         0x00860000U
#define GPIO_64_EM1D20         0x00860002U
#define GPIO_64_EM2D4          0x00860003U
#define GPIO_64_EQEP3S         0x00860005U
#define GPIO_64_SCIRXDA        0x00860006U
#define GPIO_64_SPISOMIB       0x0086000FU

#define GPIO_65_GPIO65         0x00860200U
#define GPIO_65_EM1D19         0x00860202U
#define GPIO_65_EM2D3          0x00860203U
#define GPIO_65_EQEP3I         0x00860205U
#define GPIO_65_SCITXDA        0x00860206U
#define GPIO_65_SPICLKB        0x0086020FU

#define GPIO_66_GPIO66         0x00860400U
#define GPIO_66_EM1D18         0x00860402U
#define GPIO_66_EM2D2          0x00860403U
#define GPIO_66_SDAB           0x00860406U
#define GPIO_66_SPISTEB        0x0086040FU

#define GPIO_67_GPIO67         0x00860600U
#define GPIO_67_EM1D17         0x00860602U
#define GPIO_67_EM2D1          0x00860603U

#define GPIO_68_GPIO68         0x00860800U
#define GPIO_68_EM1D16         0x00860802U
#define GPIO_68_EM2D0          0x00860803U

#define GPIO_69_GPIO69         0x00860A00U
#define GPIO_69_EM1D15         0x00860A02U
#define GPIO_69_EMU0           0x00860A03U
#define GPIO_69_SCLB           0x00860A06U
#define GPIO_69_SPISIMOC       0x00860A0FU

#define GPIO_70_GPIO70         0x00860C00U
#define GPIO_70_EM1D14         0x00860C02U
#define GPIO_70_EMU0           0x00860C03U
#define GPIO_70_CANRXA         0x00860C05U
#define GPIO_70_SCITXDB        0x00860C06U
#define GPIO_70_SPISOMIC       0x00860C0FU

#define GPIO_71_GPIO71         0x00860E00U
#define GPIO_71_EM1D13         0x00860E02U
#define GPIO_71_EMU1           0x00860E03U
#define GPIO_71_CANTXA         0x00860E05U
#define GPIO_71_SCIRXDB        0x00860E06U
#define GPIO_71_SPICLKC        0x00860E0FU

#define GPIO_72_GPIO72         0x00861000U
#define GPIO_72_EM1D12         0x00861002U
#define GPIO_72_CANTXB         0x00861005U
#define GPIO_72_SCITXDC        0x00861006U
#define GPIO_72_SPISTEC        0x0086100FU

