wtliu/EtherCAT_LAN9252_TMS320F28379D/library/driverlib/include/pin_map.h
#define GPIO_73_GPIO73         0x00861200U
#define GPIO_73_EM1D11         0x00861202U
#define GPIO_73_XCLKOUT        0x00861203U
#define GPIO_73_CANRXB         0x00861205U
#define GPIO_73_SCIRXDC        0x00861206U

#define GPIO_74_GPIO74         0x00861400U
#define GPIO_74_EM1D10         0x00861402U

#define GPIO_75_GPIO75         0x00861600U
#define GPIO_75_EM1D9          0x00861602U

#define GPIO_76_GPIO76         0x00861800U
#define GPIO_76_EM1D8          0x00861802U
#define GPIO_76_SCITXDD        0x00861806U

#define GPIO_77_GPIO77         0x00861A00U
#define GPIO_77_EM1D7          0x00861A02U
#define GPIO_77_SCIRXDD        0x00861A06U

#define GPIO_78_GPIO78         0x00861C00U
#define GPIO_78_EM1D6          0x00861C02U
#define GPIO_78_EQEP2A         0x00861C06U

#define GPIO_79_GPIO79         0x00861E00U
#define GPIO_79_EM1D5          0x00861E02U
#define GPIO_79_EQEP2B         0x00861E06U

#define GPIO_80_GPIO80         0x00880000U
#define GPIO_80_EM1D4          0x00880002U
#define GPIO_80_EQEP2S         0x00880006U

#define GPIO_81_GPIO81         0x00880200U
#define GPIO_81_EM1D3          0x00880202U
#define GPIO_81_EQEP2I         0x00880206U

#define GPIO_82_GPIO82         0x00880400U
#define GPIO_82_EM1D2          0x00880402U

#define GPIO_83_GPIO83         0x00880600U
#define GPIO_83_EM1D1          0x00880602U

#define GPIO_84_GPIO84         0x00880800U
#define GPIO_84_SCITXDA        0x00880805U
#define GPIO_84_MDXB           0x00880806U
#define GPIO_84_MDXA           0x0088080FU

#define GPIO_85_GPIO85         0x00880A00U
#define GPIO_85_EM1D0          0x00880A02U
#define GPIO_85_SCIRXDA        0x00880A05U
#define GPIO_85_MDRB           0x00880A06U
#define GPIO_85_MDRA           0x00880A0FU

#define GPIO_86_GPIO86         0x00880C00U
#define GPIO_86_EM1A13         0x00880C02U
#define GPIO_86_EM1CAS         0x00880C03U
#define GPIO_86_SCITXDB        0x00880C05U
#define GPIO_86_MCLKXB         0x00880C06U
#define GPIO_86_MCLKXA         0x00880C0FU

#define GPIO_87_GPIO87         0x00880E00U
#define GPIO_87_EM1A14         0x00880E02U
#define GPIO_87_EM1RAS         0x00880E03U
#define GPIO_87_SCIRXDB        0x00880E05U
#define GPIO_87_MFSXB          0x00880E06U
#define GPIO_87_MFSXA          0x00880E0FU

#define GPIO_88_GPIO88         0x00881000U
#define GPIO_88_EM1A15         0x00881002U
#define GPIO_88_EM1DQM0        0x00881003U

#define GPIO_89_GPIO89         0x00881200U
#define GPIO_89_EM1A16         0x00881202U
#define GPIO_89_EM1DQM1        0x00881203U
#define GPIO_89_SCITXDC        0x00881206U

#define GPIO_90_GPIO90         0x00881400U
#define GPIO_90_EM1A17         0x00881402U
#define GPIO_90_EM1DQM2        0x00881403U
#define GPIO_90_SCIRXDC        0x00881406U

#define GPIO_91_GPIO91         0x00881600U
#define GPIO_91_EM1A18         0x00881602U
#define GPIO_91_EM1DQM3        0x00881603U
#define GPIO_91_SDAA           0x00881606U

#define GPIO_92_GPIO92         0x00881800U
#define GPIO_92_EM1A19         0x00881802U
#define GPIO_92_EM1BA1         0x00881803U
#define GPIO_92_SCLA           0x00881806U

#define GPIO_93_GPIO93         0x00881A00U
#define GPIO_93_EM1A20         0x00881A02U
#define GPIO_93_EM1BA0         0x00881A03U
#define GPIO_93_SCITXDD        0x00881A06U

#define GPIO_94_GPIO94         0x00881C00U
#define GPIO_94_EM1A21         0x00881C02U
#define GPIO_94_SCIRXDD        0x00881C06U

#define GPIO_95_GPIO95         0x00881E00U

#define GPIO_96_GPIO96         0x00C60000U
#define GPIO_96_EM2DQM1        0x00C60003U
#define GPIO_96_EQEP1A         0x00C60005U

#define GPIO_97_GPIO97         0x00C60200U
#define GPIO_97_EM2DQM0        0x00C60203U
#define GPIO_97_EQEP1B         0x00C60205U

#define GPIO_98_GPIO98         0x00C60400U
#define GPIO_98_EM2A0          0x00C60403U
#define GPIO_98_EQEP1S         0x00C60405U

#define GPIO_99_GPIO99         0x00C60600U
#define GPIO_99_EM2A1          0x00C60603U
#define GPIO_99_EQEP1I         0x00C60605U

#define GPIO_100_GPIO100        0x00C60800U
#define GPIO_100_EM2A2          0x00C60803U
#define GPIO_100_EQEP2A         0x00C60805U
#define GPIO_100_SPISIMOC       0x00C60806U

#define GPIO_101_GPIO101        0x00C60A00U
#define GPIO_101_EM2A3          0x00C60A03U
#define GPIO_101_EQEP2B         0x00C60A05U
#define GPIO_101_SPISOMIC       0x00C60A06U

#define GPIO_102_GPIO102        0x00C60C00U
#define GPIO_102_EM2A4          0x00C60C03U
#define GPIO_102_EQEP2S         0x00C60C05U
#define GPIO_102_SPICLKC        0x00C60C06U

#define GPIO_103_GPIO103        0x00C60E00U
#define GPIO_103_EM2A5          0x00C60E03U
#define GPIO_103_EQEP2I         0x00C60E05U
#define GPIO_103_SPISTEC        0x00C60E06U

#define GPIO_104_GPIO104        0x00C61000U
#define GPIO_104_SDAA           0x00C61001U
#define GPIO_104_EM2A6          0x00C61003U
#define GPIO_104_EQEP3A         0x00C61005U
#define GPIO_104_SCITXDD        0x00C61006U

#define GPIO_105_GPIO105        0x00C61200U
#define GPIO_105_SCLA           0x00C61201U
#define GPIO_105_EM2A7          0x00C61203U
#define GPIO_105_EQEP3B         0x00C61205U
#define GPIO_105_SCIRXDD        0x00C61206U

#define GPIO_106_GPIO106        0x00C61400U
#define GPIO_106_EM2A8          0x00C61403U
#define GPIO_106_EQEP3S         0x00C61405U
#define GPIO_106_SCITXDC        0x00C61406U

#define GPIO_107_GPIO107        0x00C61600U
#define GPIO_107_EM2A9          0x00C61603U
#define GPIO_107_EQEP3I         0x00C61605U
#define GPIO_107_SCIRXDC        0x00C61606U

#define GPIO_108_GPIO108        0x00C61800U
#define GPIO_108_EM2A10         0x00C61803U

#define GPIO_109_GPIO109        0x00C61A00U
#define GPIO_109_EM2A11         0x00C61A03U

#define GPIO_110_GPIO110        0x00C61C00U
#define GPIO_110_EM2WAIT1       0x00C61C03U

#define GPIO_111_GPIO111        0x00C61E00U
#define GPIO_111_EM2BA0         0x00C61E03U

#define GPIO_112_GPIO112        0x00C80000U
#define GPIO_112_EM2BA1         0x00C80003U

#define GPIO_113_GPIO113        0x00C80200U
#define GPIO_113_EM2CAS         0x00C80203U

#define GPIO_114_GPIO114        0x00C80400U
#define GPIO_114_EM2RAS         0x00C80403U

