wtliu/EtherCAT_LAN9252_TMS320F28379D/library/driverlib/include/pin_map.h
#define GPIO_115_GPIO115        0x00C80600U
#define GPIO_115_EM2CS0         0x00C80603U

#define GPIO_116_GPIO116        0x00C80800U
#define GPIO_116_EM2CS2         0x00C80803U

#define GPIO_117_GPIO117        0x00C80A00U
#define GPIO_117_EM1SDCKE       0x00C80A03U

#define GPIO_118_GPIO118        0x00C80C00U
#define GPIO_118_EM2CLK         0x00C80C03U

#define GPIO_119_GPIO119        0x00C80E00U
#define GPIO_119_EM2RNW         0x00C80E03U

#define GPIO_120_GPIO120        0x00C81000U
#define GPIO_120_EM2WEN         0x00C81003U
#define GPIO_120_USB0PFLT       0x00C8100FU

#define GPIO_121_GPIO121        0x00C81200U
#define GPIO_121_EM2OEN         0x00C81203U
#define GPIO_121_USB0EPEN       0x00C8120FU

#define GPIO_122_GPIO122        0x00C81400U
#define GPIO_122_SPISIMOC       0x00C81406U
#define GPIO_122_SD1_D1         0x00C81407U
#define GPIO_122_ODISCHRGVBUS   0x00C8140FU

#define GPIO_123_GPIO123        0x00C81600U
#define GPIO_123_SPISOMIC       0x00C81606U
#define GPIO_123_SD1_C1         0x00C81607U
#define GPIO_123_OCHRGVBUS      0x00C8160FU

#define GPIO_124_GPIO124        0x00C81800U
#define GPIO_124_SPICLKC        0x00C81806U
#define GPIO_124_SD1_D2         0x00C81807U
#define GPIO_124_ODMPULLDN      0x00C8180FU

#define GPIO_125_GPIO125        0x00C81A00U
#define GPIO_125_SPISTEC        0x00C81A06U
#define GPIO_125_SD1_C2         0x00C81A07U
#define GPIO_125_ODPPULLDN      0x00C81A0FU

#define GPIO_126_GPIO126        0x00C81C00U
#define GPIO_126_SD1_D3         0x00C81C07U
#define GPIO_126_OLSD_2_N       0x00C81C0FU

#define GPIO_127_GPIO127        0x00C81E00U
#define GPIO_127_SD1_C3         0x00C81E07U
#define GPIO_127_OLSD_1_N       0x00C81E0FU

#define GPIO_128_GPIO128        0x01060000U
#define GPIO_128_SD1_D4         0x01060007U
#define GPIO_128_OIDPULLUP      0x0106000FU

#define GPIO_129_GPIO129        0x01060200U
#define GPIO_129_SD1_C4         0x01060207U
#define GPIO_129_OSPEED         0x0106020FU

#define GPIO_130_GPIO130        0x01060400U
#define GPIO_130_SD2_D1         0x01060407U
#define GPIO_130_OSUSPEND       0x0106040FU

#define GPIO_131_GPIO131        0x01060600U
#define GPIO_131_SD2_C1         0x01060607U
#define GPIO_131_OOE            0x0106060FU

#define GPIO_132_GPIO132        0x01060800U
#define GPIO_132_SD2_D2         0x01060807U
#define GPIO_132_ODMSE0         0x0106080FU

#define GPIO_133_GPIO133        0x01060A00U
#define GPIO_133_SD2_C2         0x01060A07U
#define GPIO_133_ODPDAT         0x01060A0FU

#define GPIO_134_GPIO134        0x01060C00U
#define GPIO_134_SD2_D3         0x01060C07U
#define GPIO_134_IVBUSVALID     0x01060C0FU

#define GPIO_135_GPIO135        0x01060E00U
#define GPIO_135_SCITXDA        0x01060E06U
#define GPIO_135_SD2_C3         0x01060E07U

#define GPIO_136_GPIO136        0x01061000U
#define GPIO_136_SCIRXDA        0x01061006U
#define GPIO_136_SD2_D4         0x01061007U

#define GPIO_137_GPIO137        0x01061200U
#define GPIO_137_SCITXDB        0x01061206U
#define GPIO_137_SD2_C4         0x01061207U

#define GPIO_138_GPIO138        0x01061400U
#define GPIO_138_SCIRXDB        0x01061406U

#define GPIO_139_GPIO139        0x01061600U
#define GPIO_139_SCIRXDC        0x01061606U

#define GPIO_140_GPIO140        0x01061800U
#define GPIO_140_SCITXDC        0x01061806U

#define GPIO_141_GPIO141        0x01061A00U
#define GPIO_141_SCIRXDD        0x01061A06U

#define GPIO_142_GPIO142        0x01061C00U
#define GPIO_142_SCITXDD        0x01061C06U

#define GPIO_143_GPIO143        0x01061E00U

#define GPIO_144_GPIO144        0x01080000U

#define GPIO_145_GPIO145        0x01080200U
#define GPIO_145_EPWM1A         0x01080201U

#define GPIO_146_GPIO146        0x01080400U
#define GPIO_146_EPWM1B         0x01080401U

#define GPIO_147_GPIO147        0x01080600U
#define GPIO_147_EPWM2A         0x01080601U

#define GPIO_148_GPIO148        0x01080800U
#define GPIO_148_EPWM2B         0x01080801U

#define GPIO_149_GPIO149        0x01080A00U
#define GPIO_149_EPWM3A         0x01080A01U

#define GPIO_150_GPIO150        0x01080C00U
#define GPIO_150_EPWM3B         0x01080C01U

#define GPIO_151_GPIO151        0x01080E00U
#define GPIO_151_EPWM4A         0x01080E01U

#define GPIO_152_GPIO152        0x01081000U
#define GPIO_152_EPWM4B         0x01081001U

#define GPIO_153_GPIO153        0x01081200U
#define GPIO_153_EPWM5A         0x01081201U

#define GPIO_154_GPIO154        0x01081400U
#define GPIO_154_EPWM5B         0x01081401U

#define GPIO_155_GPIO155        0x01081600U
#define GPIO_155_EPWM6A         0x01081601U

#define GPIO_156_GPIO156        0x01081800U
#define GPIO_156_EPWM6B         0x01081801U

#define GPIO_157_GPIO157        0x01081A00U
#define GPIO_157_EPWM7A         0x01081A01U

#define GPIO_158_GPIO158        0x01081C00U
#define GPIO_158_EPWM7B         0x01081C01U

#define GPIO_159_GPIO159        0x01081E00U
#define GPIO_159_EPWM8A         0x01081E01U

#define GPIO_160_GPIO160        0x01460000U
#define GPIO_160_EPWM8B         0x01460001U

#define GPIO_161_GPIO161        0x01460200U
#define GPIO_161_EPWM9A         0x01460201U

#define GPIO_162_GPIO162        0x01460400U
#define GPIO_162_EPWM9B         0x01460401U

#define GPIO_163_GPIO163        0x01460600U
#define GPIO_163_EPWM10A        0x01460601U

#define GPIO_164_GPIO164        0x01460800U
#define GPIO_164_EPWM10B        0x01460801U

#define GPIO_165_GPIO165        0x01460A00U
#define GPIO_165_EPWM11A        0x01460A01U

#define GPIO_166_GPIO166        0x01460C00U
#define GPIO_166_EPWM11B        0x01460C01U

#define GPIO_167_GPIO167        0x01460E00U
#define GPIO_167_EPWM12A        0x01460E01U

#define GPIO_168_GPIO168        0x01461000U
#define GPIO_168_EPWM12B        0x01461001U

#endif // PIN_MAP_H
